espressif/esp-idf/examples/system/efuse/sdkconfig.ci.virt_secure_boot_v1
# SECURE_BOOT_V1 with EFUSE_VIRTUAL_KEEP_IN_FLASH

# SECURE_BOOT_V1 is available only in ESP32
CONFIG_IDF_TARGET="esp32"

CONFIG_PARTITION_TABLE_OFFSET=0xC000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="test/partitions_efuse_emul.csv"

CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V1_ENABLED=y
CONFIG_SECURE_BOOT_SIGNING_KEY="test/secure_boot_signing_key_ecdsa.pem"

# IMPORTANT: ONLY VIRTUAL eFuse MODE!
CONFIG_EFUSE_VIRTUAL=y
CONFIG_EFUSE_VIRTUAL_KEEP_IN_FLASH=y
